Revit 2024 API
AnalyticalLink.Start Property
 The point at the start of the AnalyticalLink.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public XYZ Start { get; }
Visual Basic
Public ReadOnly Property Start As XYZ
	Get
Visual C++
public:
property XYZ^ Start {
	XYZ^ get ();
}
See Also
AnalyticalLink Class
Autodesk.Revit.DB.Structure Namespace